-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 21, 2022 at 01:05 PM
-- Server version: 10.4.22-MariaDB
-- PHP Version: 7.4.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `db_cart`
--
CREATE DATABASE IF NOT EXISTS `db_cart` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `db_cart`;

-- --------------------------------------------------------

--
-- Table structure for table `category`
--

CREATE TABLE `category` (
  `c_id` int(11) NOT NULL,
  `c_name` varchar(200) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `category`
--

INSERT INTO `category` (`c_id`, `c_name`) VALUES
(1, 'IT');

-- --------------------------------------------------------

--
-- Table structure for table `order_detail`
--

CREATE TABLE `order_detail` (
  `d_id` int(10) NOT NULL,
  `o_id` int(11) NOT NULL,
  `p_id` int(11) NOT NULL,
  `d_qty` int(11) NOT NULL,
  `d_subtotal` float NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `order_head`
--

CREATE TABLE `order_head` (
  `o_id` int(10) NOT NULL,
  `o_dttm` datetime NOT NULL,
  `o_name` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `o_addr` varchar(500) COLLATE utf8_unicode_ci NOT NULL,
  `o_email` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `o_phone` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `o_total` float NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `product`
--

CREATE TABLE `product` (
  `p_id` int(11) NOT NULL,
  `p_name` varchar(200) COLLATE utf8_unicode_ci DEFAULT NULL,
  `p_detail` text COLLATE utf8_unicode_ci DEFAULT NULL,
  `p_price` float DEFAULT NULL,
  `p_pic` varchar(20) COLLATE utf8_unicode_ci DEFAULT NULL,
  `c_id` varchar(100) COLLATE utf8_unicode_ci DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `product`
--

INSERT INTO `product` (`p_id`, `p_name`, `p_detail`, `p_price`, `p_pic`, `c_id`) VALUES
(1, 'book1', 'workshop นี้ได้แนะนำวิธีการสร้างเว็บไซต์จาก devbanban.com ', 349, '1.jpg', '1'),
(2, 'book2', 'workshop นี้ได้แนะนำวิธีการสร้างเว็บไซต์จาก devbanban.com ', 349, '1.jpg', '1'),
(3, 'book3', 'workshop นี้ได้แนะนำวิธีการสร้างเว็บไซต์จาก devbanban.com ', 195, '1.jpg', '1'),
(4, 'book4', 'workshop นี้ได้แนะนำวิธีการสร้างเว็บไซต์จาก devbanban.com ', 149, '1.jpg', '1'),
(5, 'book5', 'workshop นี้ได้แนะนำวิธีการสร้างเว็บไซต์จาก devbanban.com ', 249, '1.jpg', '1'),
(6, 'book6', 'workshop นี้ได้แนะนำวิธีการสร้างเว็บไซต์จาก devbanban.com ', 289, '1.jpg', '1');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`c_id`);

--
-- Indexes for table `order_detail`
--
ALTER TABLE `order_detail`
  ADD PRIMARY KEY (`d_id`);

--
-- Indexes for table `order_head`
--
ALTER TABLE `order_head`
  ADD PRIMARY KEY (`o_id`);

--
-- Indexes for table `product`
--
ALTER TABLE `product`
  ADD PRIMARY KEY (`p_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `category`
--
ALTER TABLE `category`
  MODIFY `c_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `order_detail`
--
ALTER TABLE `order_detail`
  MODIFY `d_id` int(10) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `order_head`
--
ALTER TABLE `order_head`
  MODIFY `o_id` int(10) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `product`
--
ALTER TABLE `product`
  MODIFY `p_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
--
-- Database: `my_db`
--
CREATE DATABASE IF NOT EXISTS `my_db` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `my_db`;

-- --------------------------------------------------------

--
-- Table structure for table `order_detail`
--

CREATE TABLE `order_detail` (
  `d_id` int(10) NOT NULL,
  `o_id` int(11) NOT NULL,
  `p_id` int(11) NOT NULL,
  `d_qty` int(11) NOT NULL,
  `d_subtotal` float NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `order_detail`
--

INSERT INTO `order_detail` (`d_id`, `o_id`, `p_id`, `d_qty`, `d_subtotal`) VALUES
(1, 1, 14, 1, 19000),
(2, 1, 4, 1, 19500),
(3, 2, 5, 1, 19500),
(4, 2, 4, 1, 19500),
(5, 3, 10, 1, 20900),
(6, 4, 7, 1, 27900),
(7, 4, 2, 1, 19500);

-- --------------------------------------------------------

--
-- Table structure for table `order_head`
--

CREATE TABLE `order_head` (
  `o_id` int(10) NOT NULL,
  `m_id` int(11) NOT NULL,
  `o_dttm` datetime NOT NULL,
  `o_name` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `o_addr` varchar(500) COLLATE utf8_unicode_ci NOT NULL,
  `o_email` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `o_phone` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `o_total` float NOT NULL,
  `o_status` int(11) NOT NULL COMMENT '1 = รอชำระ 2 = ชำระ 3 = ตรวจสอบ 4=ยกเลอก',
  `bid` int(2) NOT NULL DEFAULT 0,
  `o_slip` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `o_slip_date` date NOT NULL,
  `o_slip_total` float(10,2) NOT NULL DEFAULT 0.00,
  `o_ems` varchar(30) COLLATE utf8_unicode_ci DEFAULT NULL,
  `o_ems_date` datetime NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `order_head`
--

INSERT INTO `order_head` (`o_id`, `m_id`, `o_dttm`, `o_name`, `o_addr`, `o_email`, `o_phone`, `o_total`, `o_status`, `bid`, `o_slip`, `o_slip_date`, `o_slip_total`, `o_ems`, `o_ems_date`) VALUES
(1, 3, '2022-04-21 06:08:59', 'chutitorn', '110/2 ถ.สนามชัย อ.เมือง 112222', 'member1@gmail.com', '54545454545', 38500, 3, 1, 'slip172995430920220421_060916.jfif', '2022-04-21', 38500.00, 'TH1234', '2022-04-21 06:27:30'),
(2, 3, '2022-04-21 13:52:15', 'panqpanq', '110/2 ถ.สนามชัย อ.เมือง 112222', 'member1@gmail.com', '54545454545', 39000, 2, 1, 'slip162795772120220421_135448.jfif', '2022-04-21', 39000.00, '', '0000-00-00 00:00:00'),
(3, 3, '2022-04-17 13:52:29', 'panqpanq', '110/2 ถ.สนามชัย อ.เมือง 112222', 'member1@gmail.com', '54545454545', 20900, 4, 1, '', '0000-00-00', 0.00, '', '0000-00-00 00:00:00'),
(4, 3, '2022-04-21 13:52:42', 'panqpanq', '110/2 ถ.สนามชัย อ.เมือง 112222', 'member1@gmail.com', '54545454545', 47400, 1, 0, '', '0000-00-00', 0.00, '', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_bank`
--

CREATE TABLE `tbl_bank` (
  `bid` int(11) NOT NULL,
  `bname` varchar(150) NOT NULL COMMENT 'ชื่อธนาคาร',
  `bnumber` varchar(250) NOT NULL COMMENT 'เลขบัญชี',
  `bowner` varchar(250) NOT NULL COMMENT 'ชื่อเจ้าของบัญชี'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `tbl_bank`
--

INSERT INTO `tbl_bank` (`bid`, `bname`, `bnumber`, `bowner`) VALUES
(1, 'Krungthai\r\n', '123-4-567-890-1', 'นาย ธนาคารกรุงไทย'),
(2, 'Kasikornbank', '123-4-567-890-1', 'นาย ธนาคารกสิกร');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_comment`
--

CREATE TABLE `tbl_comment` (
  `c_id` int(11) NOT NULL,
  `ref_p_id` int(11) NOT NULL,
  `c_detail` text NOT NULL,
  `c_status` int(1) NOT NULL DEFAULT 0 COMMENT '0 = hide, 1 =show',
  `c_date` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='เก็บข้อมูลการแสดงความคิดเห็นต่อสินค้า';

--
-- Dumping data for table `tbl_comment`
--

INSERT INTO `tbl_comment` (`c_id`, `ref_p_id`, `c_detail`, `c_status`, `c_date`) VALUES
(1, 14, 'แพงมากแม่', 0, '2022-04-13 11:50:11'),
(2, 14, 'สุดปัง', 0, '2022-04-13 11:51:33'),
(3, 10, 'เริ่ดๆๆๆ', 0, '2022-04-13 11:52:07'),
(4, 8, 'ดีๆๆๆๆๆๆ', 1, '2022-04-13 11:52:15'),
(5, 11, 'sdcas', 1, '2022-04-13 12:00:25'),
(6, 10, 'asvasv', 1, '2022-04-13 12:06:04'),
(7, 12, 'อย่างไร', 0, '2022-04-13 12:45:24'),
(8, 12, 'ascas', 0, '2022-04-13 12:48:24'),
(9, 11, '5555', 1, '2022-04-13 12:49:37'),
(10, 14, 'โอ้ยๆ', 1, '2022-04-13 15:43:23'),
(11, 6, 'ฟหอฟหอ', 1, '2022-04-13 15:45:24'),
(12, 2, 'เขียวอองตองงงงงงง', 1, '2022-04-13 15:45:40'),
(13, 2, 'ฟหอฟหอฟ', 1, '2022-04-13 15:45:42'),
(14, 14, 'โอ้ยๆๆๆไอโฟนนนนนสีดำ', 1, '2022-04-13 18:29:25');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_counter`
--

CREATE TABLE `tbl_counter` (
  `c_id` int(11) NOT NULL,
  `c_ipadr` varchar(50) NOT NULL,
  `c_datesave` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `tbl_counter`
--

INSERT INTO `tbl_counter` (`c_id`, `c_ipadr`, `c_datesave`) VALUES
(1, '::1', '2022-04-13 20:40:55'),
(2, '::1', '2022-04-13 20:41:21'),
(3, '::1', '2022-04-13 20:41:56'),
(4, '::1', '2022-04-13 20:41:56'),
(5, '::1', '2022-04-13 20:42:22'),
(6, '::1', '2022-04-13 20:42:24'),
(7, '::1', '2022-04-14 08:45:03'),
(8, '::1', '2022-04-14 08:45:06'),
(9, '::1', '2022-04-14 08:48:24'),
(10, '::1', '2022-04-14 08:48:25'),
(11, '::1', '2022-04-14 08:49:48'),
(12, '::1', '2022-04-14 08:50:02'),
(13, '::1', '2022-04-14 08:50:29'),
(14, '::1', '2022-04-14 08:50:53'),
(15, '::1', '2022-04-14 08:51:03'),
(16, '::1', '2022-04-14 08:51:15'),
(17, '::1', '2022-04-14 08:51:23'),
(18, '::1', '2022-04-14 08:51:24'),
(19, '::1', '2022-04-14 08:51:27'),
(20, '::1', '2022-04-14 08:52:03'),
(21, '::1', '2022-04-14 08:52:20'),
(22, '::1', '2022-04-14 08:52:46'),
(23, '::1', '2021-04-08 08:54:27'),
(24, '::1', '2021-04-15 08:58:00'),
(25, '::1', '2021-04-08 09:00:15'),
(26, '::1', '2022-04-14 09:00:17'),
(27, '::1', '2022-04-14 09:00:25'),
(28, '::1', '2022-04-14 09:02:02'),
(29, '::1', '2022-04-14 09:11:33'),
(30, '::1', '2022-04-14 09:28:48'),
(31, '::1', '2022-04-14 09:29:52'),
(32, '::1', '2022-04-14 09:29:52'),
(33, '::1', '2022-04-14 09:29:52'),
(34, '::1', '2022-04-14 09:30:50'),
(35, '::1', '2022-04-14 09:33:26'),
(36, '::1', '2022-04-14 09:33:26'),
(37, '::1', '2022-04-14 09:33:26'),
(38, '::1', '2022-04-14 09:33:27'),
(39, '::1', '2022-04-14 09:33:27'),
(40, '::1', '2022-04-14 09:33:27'),
(41, '::1', '2022-04-14 09:33:32'),
(42, '::1', '2022-04-14 09:34:21'),
(43, '::1', '2022-04-14 09:34:43'),
(44, '::1', '2022-04-14 09:35:18'),
(45, '::1', '2022-04-14 09:35:26'),
(46, '::1', '2022-04-14 09:36:19'),
(47, '::1', '2022-04-14 09:37:12'),
(48, '::1', '2022-04-14 09:38:01'),
(49, '::1', '2022-04-14 09:38:02'),
(50, '::1', '2022-04-14 09:38:25'),
(51, '::1', '2022-04-14 09:39:41'),
(52, '::1', '2022-04-14 09:39:42'),
(53, '::1', '2022-04-14 09:42:49'),
(54, '::1', '2022-04-14 10:10:10'),
(55, '::1', '2022-04-14 10:10:10'),
(56, '::1', '2022-04-14 10:10:10'),
(57, '::1', '2022-04-14 10:10:11'),
(58, '::1', '2022-04-14 10:22:46'),
(59, '::1', '2022-04-14 10:22:46'),
(60, '::1', '2022-04-14 10:22:47'),
(61, '::1', '2022-04-14 10:24:46'),
(62, '::1', '2022-04-14 10:24:47'),
(63, '::1', '2022-04-14 10:24:47'),
(64, '::1', '2022-04-14 10:24:48'),
(65, '::1', '2022-04-14 10:24:57'),
(66, '::1', '2022-04-14 14:35:06'),
(67, '::1', '2022-04-14 14:35:10'),
(68, '::1', '2022-04-14 14:35:21'),
(69, '::1', '2022-04-14 14:42:40'),
(70, '::1', '2022-04-14 14:42:42'),
(71, '::1', '2022-04-14 14:42:44'),
(72, '::1', '2022-04-14 14:42:45'),
(73, '::1', '2022-04-14 14:54:29'),
(74, '::1', '2022-04-14 14:54:33'),
(75, '::1', '2022-04-14 14:54:44'),
(76, '::1', '2022-04-14 14:54:46'),
(77, '::1', '2022-04-14 14:55:11'),
(78, '::1', '2022-04-14 14:55:13'),
(79, '::1', '2022-04-14 14:55:19'),
(80, '::1', '2022-04-14 14:55:21'),
(81, '::1', '2022-04-14 14:55:26'),
(82, '::1', '2022-04-14 14:55:27'),
(83, '::1', '2022-04-14 14:55:35'),
(84, '::1', '2022-04-14 14:55:37'),
(85, '::1', '2022-04-14 14:58:29'),
(86, '::1', '2022-04-14 15:05:31'),
(87, '::1', '2022-04-14 15:07:22'),
(88, '::1', '2022-04-14 15:07:27'),
(89, '::1', '2022-04-14 15:07:44'),
(90, '::1', '2022-04-14 15:07:57'),
(91, '::1', '2022-04-14 15:08:19'),
(92, '::1', '2022-04-14 15:08:27'),
(93, '::1', '2022-04-14 15:08:28'),
(94, '::1', '2022-04-14 15:09:13'),
(95, '::1', '2022-04-14 15:09:14'),
(96, '::1', '2022-04-14 15:09:15'),
(97, '::1', '2022-04-14 15:09:16'),
(98, '::1', '2022-04-14 15:13:11'),
(99, '::1', '2022-04-14 15:13:33'),
(100, '::1', '2022-04-14 15:20:23'),
(101, '::1', '2022-04-14 15:20:24'),
(102, '::1', '2022-04-14 15:20:58'),
(103, '::1', '2022-04-14 15:21:11'),
(104, '::1', '2022-04-14 15:21:14'),
(105, '::1', '2022-04-14 15:21:15'),
(106, '::1', '2022-04-14 15:22:31'),
(107, '::1', '2022-04-14 15:23:11'),
(108, '::1', '2022-04-14 15:23:33'),
(109, '::1', '2022-04-14 15:33:37'),
(110, '::1', '2022-04-14 15:38:30'),
(111, '::1', '2022-04-14 15:39:57'),
(112, '::1', '2022-04-14 15:40:58'),
(113, '::1', '2022-04-14 15:40:59'),
(114, '::1', '2022-04-14 15:41:19'),
(115, '::1', '2022-04-14 16:50:32'),
(116, '::1', '2022-04-14 16:50:37'),
(117, '::1', '2022-04-14 16:50:55'),
(118, '::1', '2022-04-14 16:51:02'),
(119, '::1', '2022-04-14 16:51:11'),
(120, '::1', '2022-04-14 16:51:18'),
(121, '::1', '2022-04-14 16:51:19'),
(122, '::1', '2022-04-14 16:51:21'),
(123, '::1', '2022-04-14 16:51:22'),
(124, '::1', '2022-04-14 16:51:23'),
(125, '::1', '2022-04-14 16:51:29'),
(126, '::1', '2022-04-14 16:51:41'),
(127, '::1', '2022-04-14 16:51:46'),
(128, '::1', '2022-04-14 16:52:06'),
(129, '127.0.0.1', '2022-04-14 18:16:15'),
(130, '::1', '2022-04-14 18:18:49'),
(131, '::1', '2022-04-14 18:18:50'),
(132, '::1', '2022-04-14 18:18:53'),
(133, '::1', '2022-04-14 18:20:05'),
(134, '::1', '2022-04-14 18:20:59'),
(135, '::1', '2022-04-14 18:21:06'),
(136, '::1', '2022-04-14 18:21:06'),
(137, '::1', '2022-04-14 18:21:07'),
(138, '::1', '2022-04-14 18:21:13'),
(139, '::1', '2022-04-14 18:21:13'),
(140, '::1', '2022-04-14 18:21:16'),
(141, '::1', '2022-04-14 18:21:20'),
(142, '::1', '2022-04-14 18:21:59'),
(143, '::1', '2022-04-14 18:22:00'),
(144, '::1', '2022-04-14 18:22:32'),
(145, '::1', '2022-04-14 18:22:53'),
(146, '::1', '2022-04-14 18:22:53'),
(147, '::1', '2022-04-14 18:23:23'),
(148, '::1', '2022-04-14 18:24:01'),
(149, '::1', '2022-04-14 18:25:45'),
(150, '::1', '2022-04-14 18:25:57'),
(151, '::1', '2022-04-14 18:25:59'),
(152, '::1', '2022-04-14 18:26:01'),
(153, '::1', '2022-04-14 18:26:02'),
(154, '::1', '2022-04-14 18:26:34'),
(155, '::1', '2022-04-14 18:26:37'),
(156, '::1', '2022-04-14 18:27:09'),
(157, '::1', '2022-04-14 18:27:12'),
(158, '::1', '2022-04-14 18:27:55'),
(159, '::1', '2022-04-14 18:27:59'),
(160, '::1', '2022-04-14 18:28:00'),
(161, '::1', '2022-04-14 18:28:01'),
(162, '::1', '2022-04-14 18:28:35'),
(163, '::1', '2022-04-14 18:28:39'),
(164, '::1', '2022-04-14 18:28:43'),
(165, '::1', '2022-04-14 18:28:43'),
(166, '::1', '2022-04-14 18:28:44'),
(167, '::1', '2022-04-14 18:28:44'),
(168, '::1', '2022-04-14 18:28:44'),
(169, '::1', '2022-04-14 18:28:44'),
(170, '::1', '2022-04-14 18:28:45'),
(171, '::1', '2022-04-14 18:29:01'),
(172, '::1', '2022-04-14 18:29:02'),
(173, '::1', '2022-04-14 18:29:03'),
(174, '::1', '2022-04-14 18:29:04'),
(175, '::1', '2022-04-14 18:29:16'),
(176, '::1', '2022-04-14 18:29:17'),
(177, '::1', '2022-04-14 18:29:17'),
(178, '::1', '2022-04-14 18:29:17'),
(179, '::1', '2022-04-14 18:29:18'),
(180, '::1', '2022-04-14 18:29:18'),
(181, '::1', '2022-04-14 18:29:19'),
(182, '::1', '2022-04-14 18:30:14'),
(183, '::1', '2022-04-14 18:30:15'),
(184, '::1', '2022-04-14 18:30:15'),
(185, '::1', '2022-04-14 18:30:15'),
(186, '::1', '2022-04-14 18:30:16'),
(187, '::1', '2022-04-14 18:30:16'),
(188, '::1', '2022-04-14 18:30:16'),
(189, '::1', '2022-04-14 18:30:16'),
(190, '::1', '2022-04-14 18:30:55'),
(191, '::1', '2022-04-14 18:31:52'),
(192, '::1', '2022-04-14 18:32:06'),
(193, '::1', '2022-04-14 18:32:09'),
(194, '::1', '2022-04-14 18:32:10'),
(195, '::1', '2022-04-14 18:32:12'),
(196, '::1', '2022-04-14 18:33:45'),
(197, '::1', '2022-04-14 18:33:50'),
(198, '::1', '2022-04-14 18:33:55'),
(199, '::1', '2022-04-14 18:33:59'),
(200, '::1', '2022-04-14 18:34:01'),
(201, '::1', '2022-04-14 18:34:23'),
(202, '::1', '2022-04-14 18:36:45'),
(203, '::1', '2022-04-14 18:50:44'),
(204, '::1', '2022-04-14 18:50:49'),
(205, '::1', '2022-04-14 19:29:38'),
(206, '::1', '2022-04-14 19:29:40'),
(207, '::1', '2022-04-14 19:44:58'),
(208, '::1', '2022-04-14 19:46:06'),
(209, '::1', '2022-04-14 20:08:25'),
(210, '::1', '2022-04-17 10:05:16'),
(211, '::1', '2022-04-17 10:53:12'),
(212, '::1', '2022-04-17 11:31:20'),
(213, '::1', '2022-04-17 11:31:24'),
(214, '::1', '2022-04-17 11:32:55'),
(215, '::1', '2022-04-17 11:45:03'),
(216, '::1', '2022-04-17 11:46:22'),
(217, '::1', '2022-04-17 11:46:30'),
(218, '::1', '2022-04-17 11:47:58'),
(219, '::1', '2022-04-17 11:47:58'),
(220, '::1', '2022-04-17 11:47:58'),
(221, '::1', '2022-04-17 11:47:59'),
(222, '::1', '2022-04-17 11:48:05'),
(223, '::1', '2022-04-17 11:48:23'),
(224, '::1', '2022-04-17 11:50:03'),
(225, '::1', '2022-04-17 11:52:24'),
(226, '::1', '2022-04-17 12:02:01'),
(227, '::1', '2022-04-17 12:04:00'),
(228, '::1', '2022-04-17 12:07:09'),
(229, '::1', '2022-04-17 12:07:37'),
(230, '::1', '2022-04-17 12:08:22'),
(231, '::1', '2022-04-17 12:10:04'),
(232, '::1', '2022-04-17 15:05:20'),
(233, '::1', '2022-04-17 15:12:33'),
(234, '::1', '2022-04-17 15:13:44'),
(235, '::1', '2022-04-17 15:17:26'),
(236, '::1', '2022-04-17 16:13:53'),
(237, '::1', '2022-04-17 18:35:39'),
(238, '::1', '2022-04-17 18:36:40'),
(239, '::1', '2022-04-17 18:37:33'),
(240, '::1', '2022-04-17 18:38:23'),
(241, '::1', '2022-04-17 18:38:26'),
(242, '::1', '2022-04-17 18:39:57'),
(243, '::1', '2022-04-17 18:40:01'),
(244, '::1', '2022-04-17 18:40:06'),
(245, '::1', '2022-04-17 18:41:05'),
(246, '::1', '2022-04-17 18:41:12'),
(247, '::1', '2022-04-17 18:41:30'),
(248, '::1', '2022-04-17 18:41:33'),
(249, '::1', '2022-04-17 18:41:40'),
(250, '::1', '2022-04-17 18:41:45'),
(251, '::1', '2022-04-17 18:41:50'),
(252, '::1', '2022-04-17 18:41:54'),
(253, '::1', '2022-04-17 18:41:59'),
(254, '::1', '2022-04-17 18:42:54'),
(255, '::1', '2022-04-17 18:44:03'),
(256, '::1', '2022-04-17 18:46:22'),
(257, '::1', '2022-04-17 18:47:05'),
(258, '::1', '2022-04-17 18:50:40'),
(259, '::1', '2022-04-18 10:22:02'),
(260, '::1', '2022-04-18 11:12:59'),
(261, '::1', '2022-04-18 13:30:28'),
(262, '::1', '2022-04-18 13:36:23'),
(263, '::1', '2022-04-18 14:16:27'),
(264, '::1', '2022-04-18 15:02:43'),
(265, '::1', '2022-04-18 16:06:06'),
(266, '::1', '2022-04-19 03:59:39'),
(267, '::1', '2022-04-19 04:07:10'),
(268, '::1', '2022-04-19 04:36:26'),
(269, '::1', '2022-04-19 08:01:31'),
(270, '::1', '2022-04-19 08:04:25'),
(271, '::1', '2022-04-19 08:04:31'),
(272, '::1', '2022-04-19 08:09:46'),
(273, '::1', '2022-04-19 08:12:49'),
(274, '::1', '2022-04-19 15:20:56'),
(275, '::1', '2022-04-19 15:24:25'),
(276, '::1', '2022-04-19 17:22:12'),
(277, '::1', '2022-04-20 11:44:36'),
(278, '::1', '2022-04-20 15:01:40'),
(279, '::1', '2022-04-20 18:34:59'),
(280, '::1', '2022-04-20 20:28:29'),
(281, '::1', '2022-04-20 21:45:33'),
(282, '::1', '2022-04-20 21:48:53'),
(283, '::1', '2022-04-20 21:56:35'),
(284, '::1', '2022-04-20 23:08:42'),
(285, '::1', '2022-04-20 23:10:15'),
(286, '::1', '2022-04-21 06:38:31'),
(287, '::1', '2022-04-21 06:51:44'),
(288, '::1', '2022-04-21 06:54:18'),
(289, '::1', '2022-04-21 06:54:35'),
(290, '::1', '2022-04-21 06:54:57');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_login_log`
--

CREATE TABLE `tbl_login_log` (
  `log_id` int(11) NOT NULL,
  `ref_m_id` int(11) NOT NULL,
  `log_date` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='เก็บประวัติการ login ';

--
-- Dumping data for table `tbl_login_log`
--

INSERT INTO `tbl_login_log` (`log_id`, `ref_m_id`, `log_date`) VALUES
(1, 5, '2023-04-06 11:19:12'),
(2, 3, '2022-04-12 11:30:41'),
(3, 4, '2022-04-13 08:22:41'),
(4, 5, '2022-05-12 08:49:59'),
(5, 4, '2022-04-14 14:54:37'),
(6, 3, '2022-04-14 14:55:17'),
(7, 4, '2022-04-14 14:55:24'),
(8, 5, '2022-04-14 14:55:32'),
(9, 4, '2022-04-14 16:51:59'),
(10, 6, '2022-04-14 18:36:52'),
(11, 3, '2022-04-14 19:29:44'),
(12, 3, '2022-04-17 12:08:27'),
(13, 3, '2022-04-17 15:05:24'),
(14, 3, '2022-04-17 15:13:48'),
(15, 3, '2022-04-17 15:17:29'),
(16, 3, '2022-04-17 16:13:55'),
(17, 3, '2022-04-17 18:45:46'),
(18, 3, '2022-04-17 18:46:26'),
(19, 3, '2022-04-17 18:47:08'),
(20, 5, '2022-04-17 18:50:47'),
(21, 3, '2022-04-18 10:22:05'),
(22, 4, '2022-04-18 11:13:08'),
(23, 3, '2022-04-18 13:32:29'),
(24, 3, '2022-04-18 13:36:26'),
(25, 3, '2022-04-18 14:16:31'),
(26, 3, '2022-04-18 15:02:45'),
(27, 3, '2022-04-18 16:06:08'),
(28, 3, '2022-04-19 03:59:42'),
(29, 5, '2022-04-19 04:07:20'),
(30, 3, '2022-04-19 04:36:30'),
(31, 5, '2022-04-19 08:01:35'),
(32, 3, '2022-04-19 08:04:37'),
(33, 3, '2022-04-19 08:09:49'),
(34, 3, '2022-04-19 08:12:54'),
(35, 3, '2022-04-19 15:21:01'),
(36, 3, '2022-04-19 15:24:28'),
(37, 5, '2022-04-19 17:22:17'),
(38, 3, '2022-04-20 11:44:41'),
(39, 4, '2022-04-20 15:01:51'),
(40, 5, '2022-04-20 18:35:02'),
(41, 3, '2022-04-20 20:28:33'),
(42, 5, '2022-04-20 21:45:44'),
(43, 3, '2022-04-20 21:48:56'),
(44, 3, '2022-04-20 23:08:46'),
(45, 3, '2022-04-21 06:51:47'),
(46, 3, '2022-04-21 06:54:38');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_member`
--

CREATE TABLE `tbl_member` (
  `m_id` int(11) NOT NULL,
  `m_username` varchar(50) NOT NULL,
  `m_password` varchar(128) NOT NULL,
  `m_fname` varchar(20) NOT NULL,
  `m_name` varchar(100) NOT NULL,
  `m_lname` varchar(100) NOT NULL,
  `m_email` varchar(50) NOT NULL,
  `m_phone` varchar(20) NOT NULL,
  `m_address` varchar(250) NOT NULL,
  `m_img` varchar(50) NOT NULL,
  `m_level` varchar(10) NOT NULL,
  `m_datesave` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ตารางข้อมูลสมาชิก';

--
-- Dumping data for table `tbl_member`
--

INSERT INTO `tbl_member` (`m_id`, `m_username`, `m_password`, `m_fname`, `m_name`, `m_lname`, `m_email`, `m_phone`, `m_address`, `m_img`, `m_level`, `m_datesave`) VALUES
(1, 'ADMIN1', '81dc9bdb52d04dc20036dbd8313ed055', 'mr', 'ADMIN', 'ADMIN', 'Admin@gmail.com', '09090909090', '', '132810001720220409_012359.jpg', 'ADMIN', '2022-04-08 18:23:59'),
(2, 'ADMIN2', '81dc9bdb52d04dc20036dbd8313ed055', 'mr', 'ADMIN2', 'ADMIN2', 'ADMIN2@gmail.com', '90909090909', '', '157554506120220409_012433.jpg', 'ADMIN', '2022-04-08 18:24:33'),
(3, 'member1', '81dc9bdb52d04dc20036dbd8313ed055', 'miss', 'panqpanq', 'short', 'member1@gmail.com', '54545454545', '110/2 ถ.สนามชัย อ.เมือง 112222', '113683248620220409_034418.jpg', 'MEMBER', '2022-04-08 18:25:00'),
(4, 'member2', '81dc9bdb52d04dc20036dbd8313ed055', 'miss', 'member2', 'member2', 'member2@gmail.com', '76767676767', 'qwdqw 123123', '35900694320220409_012523.jpg', 'MEMBER', '2022-04-08 18:25:23'),
(5, 'member', '81dc9bdb52d04dc20036dbd8313ed055', 'Mr.', 'GGGGGG', 'GGG', 'memberer@gmail.com', '66666666666', '12313 Teribei.wevkw 123', '51007366620220409_181726.jpg', 'MEMBER', '2022-04-09 11:17:26'),
(6, 'test1', 'c4ca4238a0b923820dcc509a6f75849b', 'Mr.', 'Manop', 'eiei', 'manop@gmail.com', '012345666', '', '113766581120220415_015319.jpg', 'MEMBER', '2022-04-14 18:35:30'),
(7, 'test2', '81dc9bdb52d04dc20036dbd8313ed055', 'Mr.', 'somchai', 'ueieui', 'somchai@gmail.com', '08888181818', '', '125891899320220415_015306.jpg', 'MEMBER', '2022-04-14 18:36:44');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_prd`
--

CREATE TABLE `tbl_prd` (
  `p_id` int(11) NOT NULL,
  `ref_m_id` int(11) NOT NULL DEFAULT 0 COMMENT 'รหัสของคนเพิ่มข้อมูล',
  `ref_t_id` int(11) NOT NULL COMMENT 'รหัสประเทภสินค้า',
  `p_name` varchar(150) NOT NULL COMMENT 'ชื่อสินค้า',
  `p_intro` varchar(150) NOT NULL COMMENT 'รายละเอียดสั้นๆ',
  `p_detail` text NOT NULL,
  `p_price` float(10,2) NOT NULL,
  `p_img` varchar(100) DEFAULT NULL,
  `p_view` int(11) NOT NULL DEFAULT 0,
  `p_m_name` varchar(50) NOT NULL COMMENT 'ชื่อคนแก้สินค้า',
  `p_m_edit_date` datetime NOT NULL COMMENT 'ว/ด/ป ที่แก้สินค้า',
  `p_datesave` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ตารางเก็บข้อมูลสินค้า';

--
-- Dumping data for table `tbl_prd`
--

INSERT INTO `tbl_prd` (`p_id`, `ref_m_id`, `ref_t_id`, `p_name`, `p_intro`, `p_detail`, `p_price`, `p_img`, `p_view`, `p_m_name`, `p_m_edit_date`, `p_datesave`) VALUES
(2, 1, 1, 'iphone 11', 'สินค้าคุณภาพ', '<p>iPhone 11 ไม่มีอะแดปเตอร์แปลงไฟหรือ EarPods ให้มาด้วย&nbsp;<a href=\"https://www.apple.com/th/environment\" target=\"_blank\">ซึ่งเป็นส่วนหนึ่งในความพยายามของเราที่จะลดผลกระทบต่อสิ่งแวดล้อม</a>&nbsp;สิ่งที่มีมาให้ในกล่องได้แก่สาย USB‑C เป็น Lightning ที่รองรับการชาร์จเร็วและใช้งานได้กับอะแดปเตอร์แปลงไฟ USB-C รวมถึงพอร์ตคอมพิวเตอร์ต่างๆ<br />\r\n<br />\r\nเราส่งเสริมให้คุณใช้ซ้ำอะแดปเตอร์แปลงไฟและหูฟังที่คุณมีอยู่แล้วในตอนนี้ที่สามารถใช้งานได้กับ iPhone รุ่นนี้ แต่หากคุณต้องการอะแดปเตอร์แปลงไฟหรือหูุฟังของ Apple อันใหม่ ก็มีวางจำหน่ายให้เลือกซื้อได้</p>\r\n', 19500.00, '99956602320220409_010735.png', 7, 'member2', '2022-04-13 15:22:46', '2022-04-08 18:07:35'),
(3, 1, 1, 'iphone 11', 'สินค้าคุณภาพ', '<p>iPhone 11 ไม่มีอะแดปเตอร์แปลงไฟหรือ EarPods ให้มาด้วย&nbsp;<a href=\"https://www.apple.com/th/environment\" target=\"_blank\">ซึ่งเป็นส่วนหนึ่งในความพยายามของเราที่จะลดผลกระทบต่อสิ่งแวดล้อม</a>&nbsp;สิ่งที่มีมาให้ในกล่องได้แก่สาย USB‑C เป็น Lightning ที่รองรับการชาร์จเร็วและใช้งานได้กับอะแดปเตอร์แปลงไฟ USB-C รวมถึงพอร์ตคอมพิวเตอร์ต่างๆ<br />\r\n<br />\r\nเราส่งเสริมให้คุณใช้ซ้ำอะแดปเตอร์แปลงไฟและหูฟังที่คุณมีอยู่แล้วในตอนนี้ที่สามารถใช้งานได้กับ iPhone รุ่นนี้ แต่หากคุณต้องการอะแดปเตอร์แปลงไฟหรือหูุฟังของ Apple อันใหม่ ก็มีวางจำหน่ายให้เลือกซื้อได้</p>\r\n', 19500.00, '197126736120220409_010755.png', 0, 'GGGGGG', '2022-04-09 19:14:05', '2022-04-08 18:07:55'),
(4, 1, 1, 'iphone 11', 'สินค้าคุณภาพ', '<p>iPhone 11 ไม่มีอะแดปเตอร์แปลงไฟหรือ EarPods ให้มาด้วย&nbsp;<a href=\"https://www.apple.com/th/environment\" target=\"_blank\">ซึ่งเป็นส่วนหนึ่งในความพยายามของเราที่จะลดผลกระทบต่อสิ่งแวดล้อม</a>&nbsp;สิ่งที่มีมาให้ในกล่องได้แก่สาย USB‑C เป็น Lightning ที่รองรับการชาร์จเร็วและใช้งานได้กับอะแดปเตอร์แปลงไฟ USB-C รวมถึงพอร์ตคอมพิวเตอร์ต่างๆ<br />\r\n<br />\r\nเราส่งเสริมให้คุณใช้ซ้ำอะแดปเตอร์แปลงไฟและหูฟังที่คุณมีอยู่แล้วในตอนนี้ที่สามารถใช้งานได้กับ iPhone รุ่นนี้ แต่หากคุณต้องการอะแดปเตอร์แปลงไฟหรือหูุฟังของ Apple อันใหม่ ก็มีวางจำหน่ายให้เลือกซื้อได้</p>\r\n', 19500.00, '88581312120220409_010808.png', 0, 'GGGGGG', '2022-04-09 19:31:42', '2022-04-08 18:08:08'),
(5, 1, 1, 'iphone 11', 'สินค้าคุณภาพ', '<p>iPhone 11 ไม่มีอะแดปเตอร์แปลงไฟหรือ EarPods ให้มาด้วย&nbsp;<a href=\"https://www.apple.com/th/environment\" target=\"_blank\">ซึ่งเป็นส่วนหนึ่งในความพยายามของเราที่จะลดผลกระทบต่อสิ่งแวดล้อม</a>&nbsp;สิ่งที่มีมาให้ในกล่องได้แก่สาย USB‑C เป็น Lightning ที่รองรับการชาร์จเร็วและใช้งานได้กับอะแดปเตอร์แปลงไฟ USB-C รวมถึงพอร์ตคอมพิวเตอร์ต่างๆ<br />\r\n<br />\r\nเราส่งเสริมให้คุณใช้ซ้ำอะแดปเตอร์แปลงไฟและหูฟังที่คุณมีอยู่แล้วในตอนนี้ที่สามารถใช้งานได้กับ iPhone รุ่นนี้ แต่หากคุณต้องการอะแดปเตอร์แปลงไฟหรือหูุฟังของ Apple อันใหม่ ก็มีวางจำหน่ายให้เลือกซื้อได้</p>\r\n', 19500.00, '181739108020220409_010821.png', 0, 'GGGGGG', '2022-04-12 17:35:58', '2022-04-08 18:08:21'),
(6, 1, 2, 'iPad Pro', 'สินค้าคุณภาพ', '<ol>\r\n	<li>จอภาพมีมุมมน และเมื่อวัดเป็นสี่เหลี่ยมมุมฉากในแนวทแยงแล้ว หน้าจอ iPad Pro รุ่น 12.9 นิ้ว จะมีขนาด 12.9 นิ้ว, หน้าจอ iPad Pro รุ่น 11 นิ้ว จะมีขนาด 11 นิ้ว, หน้าจอ iPad Air จะมีขนาด 10.86 นิ้ว และหน้าจอ iPad mini จะมีขนาด 8.3 นิ้ว พื้นที่สำหรับการดูจริงมีขนาดน้อยกว่า</li>\r\n	<li>จำเป็นต้องมีแผนบริการข้อมูล, 5G, Gigabit LTE, 4G LTE ระดับ Gigabit, 4G LTE Advanced, LTE และการโทรผ่าน Wi‑Fi มีให้บริการในบางประเทศผ่านผู้ให้บริการเครือข่ายโทรศัพท์บางแห่งเท่านั้น ความเร็วขึ้นอยู่กับปริมาณงานตามหลักทฤษฎีและแตกต่างกันตามสภาวะของไซต์และผู้ให้บริการเครือข่ายโทรศัพท์ สำหรับรายละเอียดในการรองรับ 5G และ LTE โปรดติดต่อผู้ให้บริการเครือข่ายโทรศัพท์ และดูที่&nbsp;<a href=\"https://www.apple.com/th/ipad/cellular/\">apple.com/th/ipad/cellular</a></li>\r\n	<li>พื้นที่ว่างจะน้อยกว่าที่กำหนดและอาจแตกต่างกันไปอันเนื่องมาจากปัจจัยหลายประการ&nbsp;โดยการกำหนดค่าตามมาตรฐานที่ให้มานั้นจะใช้พื้นที่ประมาณ 12GB&nbsp;ถึง 17GB&nbsp;รวม iPadOS&nbsp;15&nbsp;พร้อมคุณสมบัติล่าสุดและแอปจาก Apple&nbsp;ที่สามารถลบออกได้&nbsp;แอปจาก Apple&nbsp;ที่สามารถลบออกได้นั้นใช้พื้นที่ประมาณ 4.5GB&nbsp;และคุณสามารถดาวน์โหลดกลับมาได้จาก App&nbsp;Store ความจุพื้นที่จัดเก็บข้อมูลอาจเปลี่ยนแปลงได้ขึ้นอยู่กับเวอร์ชั่นของซอฟต์แวร์&nbsp;การตั้งค่า&nbsp;และรุ่นของ iPad</li>\r\n	<li>ขนาดและน้ำหนักอาจแตกต่างกันตามการปรับแต่งและกระบวนการผลิต</li>\r\n	<li>ระยะเวลาการใช้งานแบตเตอรี่แตกต่างกันไปตามการใช้งานและการกำหนดค่า ดูข้อมูลเพิ่มเติมได้ที่&nbsp;<a href=\"https://www.apple.com/th/batteries/\">apple.com/th/batteries</a></li>\r\n	<li>แผนบริการข้อมูลเซลลูลาร์จำหน่ายแยกต่างหาก โดยรุ่นที่คุณซื้อจะได้รับการกำหนดค่าให้ทำงานกับเทคโนโลยีเครือข่ายเซลลูลาร์แบบใดแบบหนึ่งเท่านั้น โปรดตรวจสอบการใช้งานร่วมกันและ<br />\r\n	แผนบริการข้อมูลเซลลูลาร์ที่มีกับผู้ให้บริการเครือข่ายโทรศัพท์</li>\r\n	<li>ผู้ให้บริการเครือข่ายโทรศัพท์บางรายอาจไม่รองรับ Apple SIM และ eSIM โปรดสอบถามรายละเอียดเพิ่มเติมจากผู้ให้บริการเครือข่ายโทรศัพท์ ไม่มีให้บริการในจีนแผ่นดินใหญ่ เทคโนโลยี eSIM ใช้งานได้กับ iPad Pro รุ่น 11 นิ้ว (รุ่นที่ 1 หรือใหม่กว่า), iPad Pro รุ่น 12.9 นิ้ว (รุ่นที่ 3 หรือใหม่กว่า), iPad Air (รุ่นที่ 3 หรือใหม่กว่า), iPad (รุ่นที่ 7 หรือใหม่กว่า) และ iPad mini (รุ่นที่ 5 และ 6) Apple SIM ใช้งานได้กับ iPad Pro รุ่น 12.9 นิ้ว (รุ่นที่ 1 และ 2), iPad Pro รุ่น 9.7 นิ้ว, iPad Pro รุ่น 10.5 นิ้ว, iPad (รุ่นที่ 5 และ 6), iPad Air 2, iPad mini 3 และ iPad mini 4</li>\r\n</ol>\r\n', 27900.00, '94951077120220409_011429.jpg', 2, 'GGGGGG', '2022-04-10 16:48:19', '2022-04-08 18:14:29'),
(7, 1, 2, 'iPad Pro', 'สินค้าคุณภาพ', '<p>หากคุณอยู่ในที่ที่ไม่มีสัญญาณ Wi-Fi ก็ไม่มีปัญหา เพราะ iPad Pro รุ่น Wi-Fi + Cellular จะช่วยให้คุณยังคงสามารถเชื่อมต่อกับเครือข่ายข้อมูลเซลลูลาร์ที่รวดเร็วได้</p>\r\n\r\n<ul>\r\n	<li>eSIM ช่วยให้คุณตั้งค่าการเชื่อมต่อเซลลูลาร์ได้ง่ายๆ จาก iPad ของคุณ โดยไม่ต้องมีข้อผูกมัดระยะยาวใดๆ* หรือคุณจะใส่ซิมการ์ดที่เปิดใช้งานกับผู้ให้บริการเครือข่ายแล้วก็ได้</li>\r\n	<li>ท่องเว็บ ส่งอีเมลและข้อความ เข้าถึงทุกไฟล์ และอีกมากมายได้ทุกที่ทุกเวลา</li>\r\n	<li>ต่อติดกับเพื่อนๆ และครอบครัวได้ตลอด หรือทำงานร่วมกันกับทีมก็ยังได้</li>\r\n	<li>ใช้งานสัญญาณ 5G และ LTE ที่เร็วสุดแรงจากผู้ให้บริการเครือข่ายบางแห่ง</li>\r\n	<li>เพิ่มข้อมูลเซลลูลาร์ในเวลาเดินทาง และเชื่อมต่อได้ตลอดเวลาในกว่า 180 ประเทศและภูมิภาค</li>\r\n	<li>เลือกแผนจากผู้ให้บริการที่เป็นพาร์ทเนอร์ของเราที่มีหลากหลาย หรือเพิ่มไปยังแผนบริการปัจจุบันของคุณ</li>\r\n</ul>\r\n', 27900.00, '112725941920220409_011640.jpg', 9, '', '0000-00-00 00:00:00', '2022-04-08 18:16:40'),
(8, 1, 3, 'Macbook Pro', 'สินค้าคุณภาพ', '<h2>CPU แบบ 8-core<br />\r\nGPU แบบ 14-core<br />\r\nหน่วยความจำแบบรวม ขนาด 16GB<br />\r\nตัวจัดเก็บข้อมูลแบบ SSD ความจุ 512GB&sup1;</h2>\r\n\r\n<ul>\r\n	<li>Neural&nbsp;Engine แบบ 16-core</li>\r\n	<li>จอภาพ Liquid Retina XDR ขนาด 14 นิ้ว</li>\r\n	<li>พอร์ต Thunderbolt 4 จำนวน 3 พอร์ต, พอร์ต HDMI, ช่องเสียบการ์ด SDXC, พอร์ต MagSafe 3</li>\r\n	<li>Magic Keyboard พร้อม Touch ID</li>\r\n	<li>แทร็คแพด Force Touch</li>\r\n	<li>อะแดปเตอร์แปลงไฟ USB-C ขนาด 67 วัตต์</li>\r\n</ul>\r\n', 73000.00, '99937218420220409_011842.jpg', 2, '', '0000-00-00 00:00:00', '2022-04-08 18:18:42'),
(9, 1, 3, 'Macbook Pro', 'สินค้าคุณภาพ', '<h2>CPU แบบ 8-core<br />\r\nGPU แบบ 14-core<br />\r\nหน่วยความจำแบบรวม ขนาด 16GB<br />\r\nตัวจัดเก็บข้อมูลแบบ SSD ความจุ 512GB&sup1;</h2>\r\n\r\n<ul>\r\n	<li>Neural&nbsp;Engine แบบ 16-core</li>\r\n	<li>จอภาพ Liquid Retina XDR ขนาด 14 นิ้ว</li>\r\n	<li>พอร์ต Thunderbolt 4 จำนวน 3 พอร์ต, พอร์ต HDMI, ช่องเสียบการ์ด SDXC, พอร์ต MagSafe 3</li>\r\n	<li>Magic Keyboard พร้อม Touch ID</li>\r\n	<li>แทร็คแพด Force Touch</li>\r\n	<li>อะแดปเตอร์แปลงไฟ USB-C ขนาด 67 วัตต์</li>\r\n</ul>\r\n', 73000.00, '41957715720220409_011900.jpg', 1, '', '0000-00-00 00:00:00', '2022-04-08 18:19:00'),
(10, 1, 3, 'iPad Air', 'สินค้าคุณภาพ', '<p>ราคาสินค้าดังกล่าวได้รวมภาษีมูลค่าเพิ่มแล้ว&nbsp;และไม่มีค่าธรรมเนียมการจัดส่งสินค้าทุกประเภท</p>\r\n\r\n<p>* โดยประมาณ ค่าธรรมเนียมอาจเปลี่ยนแปลงได้</p>\r\n\r\n<ol>\r\n	<li>พื้นที่ว่างจะน้อยกว่าที่กำหนดและอาจแตกต่างกันไปอันเนื่องมาจากปัจจัยหลายประการ โดยการกำหนดค่าตามมาตรฐานที่ให้มานั้นจะใช้พื้นที่ประมาณ 12GB ถึง 17GB รวม iPadOS 15 พร้อมคุณสมบัติล่าสุดและแอปจาก Apple ที่สามารถลบออกได้ แอปจาก Apple ที่สามารถลบออกได้นั้นใช้พื้นที่ประมาณ 4.5GB และคุณสามารถดาวน์โหลดกลับมาได้จาก App Store ความจุพื้นที่จัดเก็บข้อมูลอาจเปลี่ยนแปลงได้ขึ้นอยู่กับเวอร์ชั่นของซอฟต์แวร์ การตั้งค่า และรุ่นของ iPad</li>\r\n	<li>จอภาพมีมุมมน และเมื่อวัดเป็นสี่เหลี่ยมมุมฉากในแนวทแยงแล้ว หน้าจอ iPad Pro รุ่น 12.9 นิ้ว จะมีขนาด 12.9 นิ้ว, หน้าจอ iPad Pro รุ่น 11 นิ้ว จะมีขนาด 11 นิ้ว, หน้าจอ iPad Air จะมีขนาด 10.86 นิ้ว และหน้าจอ iPad mini จะมีขนาด 8.3 นิ้ว พื้นที่สำหรับการดูจริงมีขนาดน้อยกว่า</li>\r\n	<li>จำเป็นต้องมีแผนบริการข้อมูล, 5G, Gigabit LTE, LTE ระดับ Gigabit, LTE Advanced, LTE และการโทรผ่าน Wi-Fi มีให้บริการในบางประเทศผ่านผู้ให้บริการเครือข่ายโทรศัพท์บางแห่งเท่านั้น ความเร็วขึ้นอยู่กับปริมาณงานตามหลักทฤษฎีและแตกต่างกันตามสภาวะของไซต์และผู้ให้บริการเครือข่ายโทรศัพท์ สำหรับรายละเอียดในการรองรับ 5G และ LTE โปรดติดต่อผู้ให้บริการเครือข่ายโทรศัพท์ และดูที่&nbsp;<a href=\"https://www.apple.com/th/ipad/cellular\">apple.com/ipad/cellular/</a></li>\r\n	<li>การใช้ Apple TV+ และ Apple Arcade ต้องสมัครสมาชิกก่อน</li>\r\n</ol>\r\n', 20900.00, '32359479920220409_012214.png', 19, '', '0000-00-00 00:00:00', '2022-04-08 18:22:14'),
(11, 1, 2, 'iPad Air', 'สินค้าคุณภาพ', '<p>ราคาสินค้าดังกล่าวได้รวมภาษีมูลค่าเพิ่มแล้ว&nbsp;และไม่มีค่าธรรมเนียมการจัดส่งสินค้าทุกประเภท</p>\r\n\r\n<p>* โดยประมาณ ค่าธรรมเนียมอาจเปลี่ยนแปลงได้</p>\r\n\r\n<ol>\r\n	<li>พื้นที่ว่างจะน้อยกว่าที่กำหนดและอาจแตกต่างกันไปอันเนื่องมาจากปัจจัยหลายประการ โดยการกำหนดค่าตามมาตรฐานที่ให้มานั้นจะใช้พื้นที่ประมาณ 12GB ถึง 17GB รวม iPadOS 15 พร้อมคุณสมบัติล่าสุดและแอปจาก Apple ที่สามารถลบออกได้ แอปจาก Apple ที่สามารถลบออกได้นั้นใช้พื้นที่ประมาณ 4.5GB และคุณสามารถดาวน์โหลดกลับมาได้จาก App Store ความจุพื้นที่จัดเก็บข้อมูลอาจเปลี่ยนแปลงได้ขึ้นอยู่กับเวอร์ชั่นของซอฟต์แวร์ การตั้งค่า และรุ่นของ iPad</li>\r\n	<li>จอภาพมีมุมมน และเมื่อวัดเป็นสี่เหลี่ยมมุมฉากในแนวทแยงแล้ว หน้าจอ iPad Pro รุ่น 12.9 นิ้ว จะมีขนาด 12.9 นิ้ว, หน้าจอ iPad Pro รุ่น 11 นิ้ว จะมีขนาด 11 นิ้ว, หน้าจอ iPad Air จะมีขนาด 10.86 นิ้ว และหน้าจอ iPad mini จะมีขนาด 8.3 นิ้ว พื้นที่สำหรับการดูจริงมีขนาดน้อยกว่า</li>\r\n	<li>จำเป็นต้องมีแผนบริการข้อมูล, 5G, Gigabit LTE, LTE ระดับ Gigabit, LTE Advanced, LTE และการโทรผ่าน Wi-Fi มีให้บริการในบางประเทศผ่านผู้ให้บริการเครือข่ายโทรศัพท์บางแห่งเท่านั้น ความเร็วขึ้นอยู่กับปริมาณงานตามหลักทฤษฎีและแตกต่างกันตามสภาวะของไซต์และผู้ให้บริการเครือข่ายโทรศัพท์ สำหรับรายละเอียดในการรองรับ 5G และ LTE โปรดติดต่อผู้ให้บริการเครือข่ายโทรศัพท์ และดูที่&nbsp;<a href=\"https://www.apple.com/th/ipad/cellular\">apple.com/ipad/cellular/</a></li>\r\n	<li>การใช้ Apple TV+ และ Apple Arcade ต้องสมัครสมาชิกก่อน</li>\r\n</ol>\r\n', 20900.00, '86710922720220409_012234.png', 20, '', '0000-00-00 00:00:00', '2022-04-08 18:22:34'),
(12, 1, 2, 'iPad Air', 'สินค้าคุณภาพ', '<p>ราคาสินค้าดังกล่าวได้รวมภาษีมูลค่าเพิ่มแล้ว&nbsp;และไม่มีค่าธรรมเนียมการจัดส่งสินค้าทุกประเภท</p>\r\n\r\n<p>* โดยประมาณ ค่าธรรมเนียมอาจเปลี่ยนแปลงได้</p>\r\n\r\n<ol>\r\n	<li>พื้นที่ว่างจะน้อยกว่าที่กำหนดและอาจแตกต่างกันไปอันเนื่องมาจากปัจจัยหลายประการ โดยการกำหนดค่าตามมาตรฐานที่ให้มานั้นจะใช้พื้นที่ประมาณ 12GB ถึง 17GB รวม iPadOS 15 พร้อมคุณสมบัติล่าสุดและแอปจาก Apple ที่สามารถลบออกได้ แอปจาก Apple ที่สามารถลบออกได้นั้นใช้พื้นที่ประมาณ 4.5GB และคุณสามารถดาวน์โหลดกลับมาได้จาก App Store ความจุพื้นที่จัดเก็บข้อมูลอาจเปลี่ยนแปลงได้ขึ้นอยู่กับเวอร์ชั่นของซอฟต์แวร์ การตั้งค่า และรุ่นของ iPad</li>\r\n	<li>จอภาพมีมุมมน และเมื่อวัดเป็นสี่เหลี่ยมมุมฉากในแนวทแยงแล้ว หน้าจอ iPad Pro รุ่น 12.9 นิ้ว จะมีขนาด 12.9 นิ้ว, หน้าจอ iPad Pro รุ่น 11 นิ้ว จะมีขนาด 11 นิ้ว, หน้าจอ iPad Air จะมีขนาด 10.86 นิ้ว และหน้าจอ iPad mini จะมีขนาด 8.3 นิ้ว พื้นที่สำหรับการดูจริงมีขนาดน้อยกว่า</li>\r\n	<li>จำเป็นต้องมีแผนบริการข้อมูล, 5G, Gigabit LTE, LTE ระดับ Gigabit, LTE Advanced, LTE และการโทรผ่าน Wi-Fi มีให้บริการในบางประเทศผ่านผู้ให้บริการเครือข่ายโทรศัพท์บางแห่งเท่านั้น ความเร็วขึ้นอยู่กับปริมาณงานตามหลักทฤษฎีและแตกต่างกันตามสภาวะของไซต์และผู้ให้บริการเครือข่ายโทรศัพท์ สำหรับรายละเอียดในการรองรับ 5G และ LTE โปรดติดต่อผู้ให้บริการเครือข่ายโทรศัพท์ และดูที่&nbsp;<a href=\"https://www.apple.com/th/ipad/cellular\">apple.com/ipad/cellular/</a></li>\r\n	<li>การใช้ Apple TV+ และ Apple Arcade ต้องสมัครสมาชิกก่อน</li>\r\n</ol>\r\n', 20900.00, '123746597920220409_012249.png', 24, '', '0000-00-00 00:00:00', '2022-04-08 18:22:49'),
(14, 1, 1, 'iphone 11', 'สินค้าคุณภาพ', '<p>iPhone 11 ไม่มีอะแดปเตอร์แปลงไฟหรือ EarPods ให้มาด้วย&nbsp;<a href=\"https://www.apple.com/th/environment\" target=\"_blank\">ซึ่งเป็นส่วนหนึ่งในความพยายามของเราที่จะลดผลกระทบต่อสิ่งแวดล้อม</a>&nbsp;สิ่งที่มีมาให้ในกล่องได้แก่สาย USB‑C เป็น Lightning ที่รองรับการชาร์จเร็วและใช้งานได้กับอะแดปเตอร์แปลงไฟ USB-C รวมถึงพอร์ตคอมพิวเตอร์ต่างๆ<br />\r\nเราส่งเสริมให้คุณใช้ซ้ำอะแดปเตอร์แปลงไฟและหูฟังที่คุณมีอยู่แล้วในตอนนี้ที่สามารถใช้งานได้กับ iPhone รุ่นนี้ แต่หากคุณต้องการอะแดป</p>\r\n', 19000.00, '106594407620220410_165851.png', 22, '', '0000-00-00 00:00:00', '2022-04-10 09:58:51');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_prd_type`
--

CREATE TABLE `tbl_prd_type` (
  `t_id` int(11) NOT NULL,
  `t_name` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ตารางเก็บข้อมูลประเภทสินค้า';

--
-- Dumping data for table `tbl_prd_type`
--

INSERT INTO `tbl_prd_type` (`t_id`, `t_name`) VALUES
(1, 'iPhone'),
(2, 'iPad'),
(3, 'Macbook'),
(4, 'Computer');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_prd_update_log`
--

CREATE TABLE `tbl_prd_update_log` (
  `lid` int(11) NOT NULL,
  `ref_p_id` int(11) NOT NULL,
  `ref_m_id` int(11) NOT NULL,
  `l_date_save` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='เก็บประวัติของคนที่เข้ามาแก้ไขสินค้า';

--
-- Dumping data for table `tbl_prd_update_log`
--

INSERT INTO `tbl_prd_update_log` (`lid`, `ref_p_id`, `ref_m_id`, `l_date_save`) VALUES
(1, 2, 5, '2022-04-12 10:34:50'),
(2, 2, 5, '2022-04-12 10:35:29'),
(3, 5, 5, '2022-04-12 10:36:00'),
(4, 2, 3, '2022-04-12 11:00:00'),
(5, 2, 4, '2022-04-13 08:22:48');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_problem`
--

CREATE TABLE `tbl_problem` (
  `p_id` int(11) NOT NULL,
  `p_detail` varchar(300) NOT NULL,
  `p_email` varchar(50) NOT NULL,
  `p_phone` varchar(20) NOT NULL,
  `p_datesave` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ตารางสำหรับแจ้งปัญหาการใช้งานเว็บไซต์';

--
-- Dumping data for table `tbl_problem`
--

INSERT INTO `tbl_problem` (`p_id`, `p_detail`, `p_email`, `p_phone`, `p_datesave`) VALUES
(1, 'Test project', 'asc@s.co', '123123', '2022-04-14 09:38:23'),
(2, 'เทสระบบแบบมี br', 'asc@s.co', '123123', '2022-04-14 09:42:47'),
(3, 'gfsdcAC', 'asc@s.co', '123123', '2022-04-14 10:24:53'),
(4, 'ย่าๆๆๆๆๆ', 'asc@as.com', '0881602481', '2022-04-14 15:39:03'),
(5, 'โหลย่า เทสๆ ขอตังหน่อย', 'asc@s.co', '08888888888', '2022-04-14 15:41:17');

-- --------------------------------------------------------

--
-- Table structure for table `tbl_slide`
--

CREATE TABLE `tbl_slide` (
  `s_id` int(11) NOT NULL,
  `s_title` varchar(100) NOT NULL,
  `s_status` varchar(5) NOT NULL,
  `s_link` varchar(200) NOT NULL,
  `s_img` varchar(100) NOT NULL,
  `s_datesave` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `order_detail`
--
ALTER TABLE `order_detail`
  ADD PRIMARY KEY (`d_id`);

--
-- Indexes for table `order_head`
--
ALTER TABLE `order_head`
  ADD PRIMARY KEY (`o_id`);

--
-- Indexes for table `tbl_bank`
--
ALTER TABLE `tbl_bank`
  ADD PRIMARY KEY (`bid`);

--
-- Indexes for table `tbl_comment`
--
ALTER TABLE `tbl_comment`
  ADD PRIMARY KEY (`c_id`);

--
-- Indexes for table `tbl_counter`
--
ALTER TABLE `tbl_counter`
  ADD PRIMARY KEY (`c_id`);

--
-- Indexes for table `tbl_login_log`
--
ALTER TABLE `tbl_login_log`
  ADD PRIMARY KEY (`log_id`);

--
-- Indexes for table `tbl_member`
--
ALTER TABLE `tbl_member`
  ADD PRIMARY KEY (`m_id`);

--
-- Indexes for table `tbl_prd`
--
ALTER TABLE `tbl_prd`
  ADD PRIMARY KEY (`p_id`);

--
-- Indexes for table `tbl_prd_type`
--
ALTER TABLE `tbl_prd_type`
  ADD PRIMARY KEY (`t_id`);

--
-- Indexes for table `tbl_prd_update_log`
--
ALTER TABLE `tbl_prd_update_log`
  ADD PRIMARY KEY (`lid`);

--
-- Indexes for table `tbl_problem`
--
ALTER TABLE `tbl_problem`
  ADD PRIMARY KEY (`p_id`);

--
-- Indexes for table `tbl_slide`
--
ALTER TABLE `tbl_slide`
  ADD PRIMARY KEY (`s_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `order_detail`
--
ALTER TABLE `order_detail`
  MODIFY `d_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `order_head`
--
ALTER TABLE `order_head`
  MODIFY `o_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `tbl_bank`
--
ALTER TABLE `tbl_bank`
  MODIFY `bid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `tbl_comment`
--
ALTER TABLE `tbl_comment`
  MODIFY `c_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `tbl_counter`
--
ALTER TABLE `tbl_counter`
  MODIFY `c_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=291;

--
-- AUTO_INCREMENT for table `tbl_login_log`
--
ALTER TABLE `tbl_login_log`
  MODIFY `log_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;

--
-- AUTO_INCREMENT for table `tbl_member`
--
ALTER TABLE `tbl_member`
  MODIFY `m_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `tbl_prd`
--
ALTER TABLE `tbl_prd`
  MODIFY `p_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `tbl_prd_type`
--
ALTER TABLE `tbl_prd_type`
  MODIFY `t_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `tbl_prd_update_log`
--
ALTER TABLE `tbl_prd_update_log`
  MODIFY `lid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `tbl_problem`
--
ALTER TABLE `tbl_problem`
  MODIFY `p_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `tbl_slide`
--
ALTER TABLE `tbl_slide`
  MODIFY `s_id` int(11) NOT NULL AUTO_INCREMENT;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
